neosoultech/bioimpedance_msp430_test/main.c
    // MAX30002 CNFG_BIOZ field values for near-10kHz BioZ start
#define MAX_BIOZ_RATE_32SPS      (1UL << 23)
#define MAX_BIOZ_AHPF_BYPASS   (6UL << 20)
#define MAX_BIOZ_USE_INTERNAL_BIASGEN (0UL << 19)
#define MAX_BIOZ_LOW_NOISE       (1UL << 18)
#define MAX_BIOZ_GAIN_10         (0UL << 16)
#define MAX_BIOZ_DHPF_0P05HZ     (1UL << 14)
#define MAX_BIOZ_DLPF_4HZ        (1UL << 12)
#define MAX_BIOZ_FCGEN_8192HZ    (4UL << 8)
#define MAX_BIOZ_CGMON_OFF       (0UL << 7)
#define MAX_BIOZ_CGMAG_TEST      (3UL << 4)
#define MAX_BIOZ_PHOFF_0         (0UL << 0)
#define MAX_CFG_CNFG_BIOZ_START  (\
    MAX_BIOZ_RATE_32SPS             | /* 32 samples per second to save power */ \
    MAX_BIOZ_AHPF_BYPASS             |/* AHPF[2:0] = 110, bypass analog HPF. Measurements are more accurate on low freq with HPF disabled. */ \
    MAX_BIOZ_USE_INTERNAL_BIASGEN   | /* Use MAX30002 internal bias generator instead of external resistor */ \
    MAX_BIOZ_LOW_NOISE              | /* Low noise mode (cleaner data, but more power) */ \
    MAX_BIOZ_GAIN_10                | /* 10 V/V gain; testing lowest 1st */ \
    MAX_BIOZ_DHPF_0P05HZ            | /* Digital HPF to preserve slower trends */ \
    MAX_BIOZ_DLPF_4HZ               | /* Digital LPF to reduce noise and output bandwidth */ \
    MAX_BIOZ_FCGEN_8192HZ           | /* 8.192KHz generated current frequency, closest to 10KHz (wanted previously) */ \
    MAX_BIOZ_CGMON_OFF              | /* Current generator compliance monitor OFF. Diagnostic for later */ \
    MAX_BIOZ_CGMAG_TEST             | /* 32uA injected current magnitude. Using middle low value. */ \
    MAX_BIOZ_PHOFF_0)                 /* No phase offset */

                                    //

                             // ST25DV REGISTER MAP //
// ST25DV I2C addresses
#define ST25DV_ADDR_USER       0x53
#define ST25DV_ADDR_SYSTEM     0x57

// ST25DV register addresses
#define ST25DV_TEST_EEPROM_ADDR         0x0000
#define ST25DV_REG_MB_MODE     0x000D

// ST25DV mailbox memory
#define ST25DV_MAILBOX_BASE    0x2008

// ST25DV bit masks
#define ST25DV_MB_MODE_ENABLE  0x01
                                        //

                      //TEST MODE MACROS. ONLY 1 AT A TIME CAN BE ENABLED. //
#define TEST_MODE            1
// if test mode enabled...
#define TEST_ST25_WRITE      1
#define TEST_ST25_READ       0
#define TEST_ST25_GPO        0
#define TEST_ST25_MAILBOX    0

#define TEST_MAX_SPI         0
#define TEST_MAX_ID          0
#define TEST_MAX_CONFIG      0
#define TEST_MAX_START       0
#define TEST_MAX_READ        0

                                        //

                        // OTHER MACROS (DON'T CHANGE)
#define LED_ON()    (P1OUT |= BIT0) // LED on indicates error.
#define LED_OFF()   (P1OUT &= ~BIT0) // LED off indicates IDLE/SLEEP
#define LED_TOGGLE() (P1OUT ^= BIT0) // macro to toggle LED on and off. --> Indicates that sensing/transmission occuring
#define MAX_CS_LOW() (P1OUT &= ~BIT7) //select MAX30002, CS active low
#define MAX_CS_HIGH()(P1OUT |= BIT7) // deselect MAX30002
                                        //

                        // FUNCTION DECLARATIONS
int st25dv_write(uint8_t slave, uint16_t mem_addr, uint8_t data);
void i2c_init();
void i2c_pins_init();
void error_handler(void);
void led_blink_measuring(void);
void led_pulse_transmission(void);
void led_idle(void);
uint8_t st25dv_read(uint8_t slave, uint16_t addr);
void gpo_init();
void mailbox_write(uint8_t *message, int length);
int check_nack();
void wait_tx_ready();
int i2c_send_and_check(uint8_t byte);
void enable_mailbox(void);
void max_int_init(void);
void wait_rx_ready(void);
void spi_init(void);
void spi_pins_init(void);
uint8_t spi_transfer(uint8_t data);
uint32_t max30002_read_reg(uint8_t reg);
void max30002_write_reg(uint8_t reg, uint32_t data);
void max30002_reset(void);
void max30002_fifo_reset(void);
uint32_t max30002_read_info(void);
uint32_t max30002_read_status(void);
uint32_t max30002_read_fifo(void);
void max30002_synch(void);
void fclk_init(void);
int32_t bioz_parse(uint32_t raw);
                                        //

int main(void)
{
	WDTCTL = WDTPW | WDTHOLD;	// stop watchdog timer
	 PM5CTL0 &= ~LOCKLPM5;       // Unlock GPIO ports to activate I/O pins

	// LED
	P1DIR |= BIT0; // setting pin 1.0 as LED output (1)
	P1OUT &= ~BIT0; // setting pin 1.0 to a 0 as value

	// init
	i2c_pins_init();
	i2c_init();
	spi_pins_init();
	spi_init();
	fclk_init();
	gpo_init();
	max_int_init();
	enable_mailbox(); // enabling mailbox (can still use EEPROM while on)
	__enable_interrupt(); // enabling global interrupts


	// TEST FUNCTIONS
	while(1) {
#if TEST_MODE // if test mode enabled


    #if TEST_ST25_WRITE // TEST 1: MCU WRITE --> ST25
	    if (st25dv_write(ST25DV_ADDR_USER, ST25DV_TEST_EEPROM_ADDR, 0xAA)) { // sending test byte 0xAA to address 0x0000 on ST25DV (slave addr 0x53). Checking to see if successful (ST25DV will respond)
	                led_pulse_transmission(); // pulse LED if transmission success
	                }
	            else {
	                error_handler(); // if not successful (ERR), LED is solid forever
	            }

    #elif TEST_ST25_READ // TEST 2: MCU READ <-- ST25
	    uint8_t val; // declare value variable
	    st25dv_write(ST25DV_ADDR_USER, ST25DV_TEST_EEPROM_ADDR, 0xAA); // write 0xAA to 0x0000 on st25dv
	    __delay_cycles(1000000); // 1s to wait for it to store in mem
	    val = st25dv_read(ST25DV_ADDR_USER, ST25DV_TEST_EEPROM_ADDR); // reading it back from 0x0000
	    if (val == 0xAA){
	        led_pulse_transmission(); // pulse LED for success
	    }
	    else {
	        error_handler(); // solid for failure
	    }
	    __delay_cycles(1000000);

    #elif TEST_ST25_GPO // TEST 3: SEE IF ST25 SENDS PHONE DETECT SIGNAL ON GPO
	    if (phone_flag == 1) { // if detect phone
	        phone_flag = 0; // clear interrupt event after handling
	        led_pulse_transmission(); // pulse LED
	    }
	    else {
	        led_idle(); // LED stays off
	    }

    #elif TEST_ST25_MAILBOX // TEST 4: Phone tap, MCU writes to mailbox, LED blinks to confirm
	    if (phone_flag) {
	            phone_flag = 0; // clear interrupt
	            uint8_t msg[] = {
	                0xD1, // NDEF header byte to tell phone it's NFC text
	                0x01, // length of type field
	                0x14, // payload length (1 status byte + 2 "en" + 17 message length)

