neosoultech/bioimpedance_msp430_test/main.c
	                'T', // type field T for text

	                0x02, 'e', 'n', // language code (english, 2 chars)

	                'H','e','l','l','o',' ', // message
	                'f','r','o','m',' ',
	                'M','S','P','4','3','0','!'
	            };

	            mailbox_write(msg, sizeof(msg)); // write to mailbox


	            led_pulse_transmission(); // if success, pulse

	                    __delay_cycles(200000);
	                }
	                else {
	                    led_idle(); // no phone/event, remains off
	                }

    #elif TEST_MAX_SPI // TEST 5: Basic MAX30002 SPI connection test. Checks to see if reads anything from INFO
	    uint32_t info;
	    max30002_reset(); // RESET to start from known state
	    (void)max30002_read_status(); // INFO should not be first command after power-up/reset
	    __delay_cycles(10000);

	    info = max30002_read_info();
	    if ((info != 0x000000) && (info != 0xFFFFFF)) { // check to see if anything there
	        led_pulse_transmission(); // Pulse LED; SPI returned something plausible
	    }
	    else {
	        error_handler(); // likely SPI wiring or mode issue. SOLID LED
	    }
	    __delay_cycles(1000000);

	 #elif TEST_MAX_ID // TEST 6: More in depth MAX30002 SPI communication test. Reads/compares info register.
	    uint32_t info;
	    max30002_reset(); // RESET to start from known state
	    (void)max30002_read_status(); // read status first as dummy transaction. Cannot read info command right away per data sheet.
	    __delay_cycles(10000); // 10ms delay

	    info = max30002_read_info(); // read info register just as a test for SPI communication
	    if ((info & 0xF03000) == 0x502000) { // D[23:20] should be 0101 (5), D[13:12] should be 10 (fixed INFO/part-ID related bits)
	        led_pulse_transmission(); // pulse LED if what read looks valid
	    }
	    else {
	        error_handler(); // solid LED
	    }
	    __delay_cycles(1000000); // 1 second between test

    #elif TEST_MAX_CONFIG // TEST 7: Write to and read from MAX30002 config registers
	    uint32_t en_int_read;
	    max30002_reset(); // RESET to start from known state
	    (void)max30002_read_status(); // read status first as dummy transaction
	    __delay_cycles(10000); // 10ms delay

	    max30002_write_reg(MAX_REG_EN_INT, 0x000002); // writing to low bits of EN_INT register. Open drain NMOS without internal pull up
	    __delay_cycles(10000); // 10 ms delay
	    en_int_read = max30002_read_reg(MAX_REG_EN_INT); // read what we just wrote
	    if ((en_int_read & 0x000003) == MAX_INTB_OPEN_DRAIN) { // lower bits should be '10 (2 decimal)' for open drain
	        led_pulse_transmission(); // config write/read worked
	    }
	    else {
	        error_handler(); // solid LED if error
	    }
	    __delay_cycles(1000000); // 1 second between tests

    #elif TEST_MAX_START // TEST 8: Configure and start MAX30002 BioZ operation
	    uint32_t bmux;
	    uint32_t en_int_read;
	    uint32_t gen_read;
	    uint32_t mngr_int_read;
	    uint32_t bmux_read;
	    uint32_t bioz_read;

	    max30002_reset(); // reset to known state
	    (void)max30002_read_status(); // dummy transaction. Can't do INFO as first command after reset.
	    __delay_cycles(10000); // 10 ms delay

	    max30002_write_reg(MAX_REG_EN_INT, MAX_CFG_EN_INT_START); // Configure INTB: allow BioZ FIFO interrupt & overflow to drive INTB, use open drain INTB output
	    max30002_write_reg(MAX_REG_MNGR_INT, MAX_CFG_MNGR_INT_START); // Configure interrupt manager so interrupt if >=1 BioZ sample in FIFO, and interrupt flag clears auto.
	    max30002_write_reg(MAX_REG_CNFG_BIOZ, MAX_CFG_CNFG_BIOZ_START); // Configure BioZ channel: 32sps, 8.192Khz, low noise, 10V/V gain, midrange current magnitude

	    bmux = max30002_read_reg(MAX_REG_CNFG_BMUX); // read BMUX config
	    bmux &= ~(MAX_BMUX_OPENP_BIT | MAX_BMUX_OPENN_BIT); // clear OPENP AND OPENN so BIP and BIN connected to BioZ channel
	    max30002_write_reg(MAX_REG_CNFG_BMUX, bmux); // Connected BIP & BIN to BioZ channel

	    max30002_write_reg(MAX_REG_CNFG_GEN, MAX_CFG_CNFG_GEN_START); // Enable BioZ & internal lead biasing. Requires EN_BIOZ to be asserted same time (done)
	    __delay_cycles(100000); // 0.1s startup

	    // Reset FIFO
	    max30002_fifo_reset();
	    max30002_synch();
	    __delay_cycles(100000); // allow BioZ to begin running

	    en_int_read   = max30002_read_reg(MAX_REG_EN_INT); // reading registers
	    mngr_int_read = max30002_read_reg(MAX_REG_MNGR_INT);
	    gen_read      = max30002_read_reg(MAX_REG_CNFG_GEN);
	    bmux_read     = max30002_read_reg(MAX_REG_CNFG_BMUX);
	    bioz_read     = max30002_read_reg(MAX_REG_CNFG_BIOZ);

	    if (((en_int_read & MAX_CFG_EN_INT_START) == MAX_CFG_EN_INT_START) && // check that the registers have been altered
	                ((mngr_int_read & MAX_CFG_MNGR_INT_START) == MAX_CFG_MNGR_INT_START) &&
	                ((gen_read & MAX_CFG_CNFG_GEN_START) == MAX_CFG_CNFG_GEN_START) &&
	                ((bmux_read & (MAX_BMUX_OPENP_BIT | MAX_BMUX_OPENN_BIT)) == 0) &&
	                (bioz_read == MAX_CFG_CNFG_BIOZ_START)) {
	        for (int i = 0; i < 6; i++) {
	                        led_blink_measuring(); // Blink while measuring if success
	                    }

	                    led_idle(); // stop blinking
	                }
	                else {
	                    error_handler(); // solid LED if config/start failed
	    }
	    __delay_cycles(1000000); // 1 second between tests

    #elif TEST_MAX_READ

	    uint32_t status;
	    uint32_t raw;
	    int32_t bioz;

	    max30002_reset(); // reset before use, read status as first command
	    (void)max30002_read_status();
	    __delay_cycles(10000);

	    max30002_write_reg(MAX_REG_EN_INT, MAX_CFG_EN_INT_START); // setup for MAX
	    max30002_write_reg(MAX_REG_MNGR_INT, MAX_CFG_MNGR_INT_START);

	    uint32_t bmux = max30002_read_reg(MAX_REG_CNFG_BMUX);
	        bmux &= ~(MAX_BMUX_OPENP_BIT | MAX_BMUX_OPENN_BIT);
	        max30002_write_reg(MAX_REG_CNFG_BMUX, bmux);

	        max30002_write_reg(MAX_REG_CNFG_BIOZ, MAX_CFG_CNFG_BIOZ_START);
	            max30002_write_reg(MAX_REG_CNFG_GEN, MAX_CFG_CNFG_GEN_START);

	            __delay_cycles(100000); // delay

	                max30002_fifo_reset(); // reset FIFO to prepare for measurement
	                max30002_synch();

