neosoultech/bioimpedance_msp430_test/main.c
	                __delay_cycles(100000);
// READ LOOP:
	                while(1) {
	                    if (max_flag) { // set by ISR on INTB
	                        max_flag = 0; // reset flag
	                        status = max30002_read_status(); // read its status

	                        if (status & MAX_STATUS_BOVF) { // checking first for overflow
	                            max30002_fifo_reset();
	                        }
	                        while (status & MAX_STATUS_BINT) { // if FIFO here
	                            raw = max30002_read_fifo(); // read it
	                            bioz = bioz_parse(raw); // parse data

	                            debug_bioz = bioz; // debug; latest parsed value
	                            sample_count++; // debug; count samples recieved

	                            uint8_t tag = raw & 0x07; // Debug: extract tag bits if needed
	                            LED_TOGGLE(); // if successful read, blink if FIFO producing data
	                            status = max30002_read_status(); // check if there are more samples to read
	                        }

	                        }
	                    }

    #endif // ends test chain
    #endif // end program

#if USE_LPM
	__bis_SR_register(LPM0_bits | GIE); // enter low power mode, enable interrupts
#else
	    __delay_cycles(200000); // delay by 0.2s
#endif
	}
}

// END TEST FUNCTIONS

                            // HELPER FUNCTIONS

// I2C / ST25DV

void i2c_pins_init() { //initializing communication pins on MSP430
    P1SEL0 |= BIT2 | BIT3;  // to select I2C, SEL0 needs have bits 2 and 3 as 1.
    P1SEL1 &= ~(BIT2 | BIT3); // to select I2C, SEL1 needs to be 0 for bits 2 and 3.
}

void i2c_init() { // initializing I2C sequence
    UCB0CTLW0 = UCSWRST; // completely reset I2C registers. Going to set bits within CTL (control register)

    UCB0CTLW0 |= UCMODE_3 | // enabling I2C mode (11)
                 UCMST    | // enabling master mode (generating clock, initializing comms)
                 UCSSEL__SMCLK; // enable clock

    UCB0BRW = 10; // clock speed set to 100 KHz
    UCB0CTLW0 &= ~UCSWRST; // enabling system
}

void gpo_init() {
    P2DIR &= ~BIT0; // P2.0 is GPO input from ST25DV
    P2REN |= BIT0; // turn on internal resistor since GPO pin open drain
    P2OUT |= BIT0; // enable pull-up (from ST25DV datasheet, GPO is active low)
    P2IES |= BIT0; // interrupt edge set to falling edge (high to low)
    P2IFG &= ~BIT0; // clearing interrupt flag
    P2IE  |= BIT0; // enable interrupts

    if (!(P2IN & BIT0)) {
        phone_flag = 1; // if phone/GPO alr active before interrupts enabled
    }
}

int check_nack(void) { // helper function to check NACK
    if (UCB0IFG & UCNACKIFG) { //bitwise check in interrupt flag reg to see if NACK bit set
        UCB0IFG &= ~UCNACKIFG; // if NACK flag set, clear it (prevents unwanted behavior in future)
        UCB0CTLW0 |= UCTXSTP; // send STOP command to system (transmission did not work)
        while (UCB0CTLW0 & UCTXSTP); // wait for STOP command to go through before ending loop
        return 1; // NACK occurred
    }
    return 0; // no NACK
}

void wait_tx_ready(void) { // helper function to wait until TX buf ready
    while (!(UCB0IFG & UCTXIFG0));
}

void wait_rx_ready(void) { // helper function to wait until RX buf ready
    while (!(UCB0IFG & UCRXIFG0));
}

int i2c_send_and_check(uint8_t byte) { // sends a byte and checks to see if recieved
        UCB0TXBUF = byte; // get byte
        wait_tx_ready(); // waiting here until byte done sending
        return check_nack(); // 1 = error, 0 = OK
}

int st25dv_write(uint8_t slave, uint16_t mem_addr, uint8_t data) { // function to send a test byte. mem_addr is 16bit address, uint8_t slave is the 8 bit slave address, and uint8_t data is the test byte of data. Returns 1 if success, 0 if not.
// SETUP
    UCB0I2CSA = slave; // Target I2C device with slave address 'slave'
    UCB0CTLW0 |= UCTR | UCTXSTT; // Set to transmission mode for master, then transmit START condition in master mode
    wait_tx_ready(); // waiting here until transit buffer flag set
    if (check_nack() == 1) return 0; // if NACK, stop and report failure
// DATA TRANSMISSION
    if (i2c_send_and_check((mem_addr >> 8) & 0xFF)) return 0; // extract/send high byte of 16 bit addr
    if (i2c_send_and_check(mem_addr & 0xFF)) return 0; // extract/send lower byte of 16 bit addr
    if (i2c_send_and_check(data)) return 0; // send a byte of data.s
// STOPPING DATA TRANSMISSION
    UCB0CTLW0 |= UCTXSTP; // stop transmitting
    while (UCB0CTLW0 & UCTXSTP); // wait for STOP command to go through before ending loop
        return 1; // returns a 1 if success
}

uint8_t st25dv_read(uint8_t slave, uint16_t mem_addr) { // MCU gets address and asks ST25DV to send data
    uint8_t data; // declaring data that will be passed from ST25DV
    // writing address
        UCB0I2CSA = slave; // Target I2C device with slave address 'slave'
        UCB0CTLW0 |= UCTR | UCTXSTT; // Set to transmission mode for master, then transmit START condition in master mode
        wait_tx_ready(); // waiting here until transit buffer flag set
        if (check_nack() == 1) return 0xFF; // if NACK, stop and report failure
        if (i2c_send_and_check((mem_addr >> 8) & 0xFF)) return 0xFF; // extract/send high byte of 16 bit addr
        if (i2c_send_and_check(mem_addr & 0xFF)) return 0xFF; // extract/send lower byte of 16 bit addr
        // switch to read mode
        UCB0CTLW0 &= ~UCTR; // transmission mode disabled, read enabled
        UCB0CTLW0 |= UCTXSTT; // START
        while (UCB0CTLW0 & UCTXSTT); // wait for START to finish
        // get 1 byte
        UCB0CTLW0 |= UCTXSTP; // only get 1 byte then stop
        wait_rx_ready();
        data = UCB0RXBUF; // get data from buffer
        while (UCB0CTLW0 & UCTXSTP); // wait for STOP command to go through before ending loop

        return data;
    }

void enable_mailbox (void) {
    uint8_t val = st25dv_read(ST25DV_ADDR_SYSTEM, ST25DV_REG_MB_MODE); //  reading static mailbox mode register
    val |= ST25DV_MB_MODE_ENABLE; // set MB_MODE bit to allow Fast Transfer Mode/mailbox use
    st25dv_write(ST25DV_ADDR_SYSTEM, ST25DV_REG_MB_MODE, val); // sets MB_MODE/static mailbox mode before mailbox use
}

void mailbox_write(uint8_t *message, int length) { // write message bytes into ST25DV mailbox buffer
    int i;
    for (i = 0; i < length; i++) { // loop to write serially to mailbox (one byte at a time)
        st25dv_write(ST25DV_ADDR_USER, ST25DV_MAILBOX_BASE + i, message[i]); // must start writing at x2008 (start of mailbox buffer)
    }
}

