neosoultech/bioimpedance_msp430_test/main.c
// SPI/MAX30002
void spi_pins_init(void) {
    P1SEL0 |= BIT4 | BIT5 | BIT6; // to select SPI, SEL0 needs to have bits 4,5,6 as 1.
    P1SEL1 &= ~(BIT4 | BIT5 | BIT6); // to select SPI, SEL1 needs to have bits
    P1DIR |= BIT7; // bit 7 is output (chip select)
    MAX_CS_HIGH(); // deselect MAX30002 to prevent accidental SPI commands during startup
}

void spi_init(void) { // clock idle low
    UCA0CTLW0 = UCSWRST; // completely reset SPI
    UCA0CTLW0 |= UCMODE_0 | // enabling SPI mode
                 UCSYNC   | // synchronous mode
                 UCMST    | // master mode
                 UCMSB    | // MSB 1st
                 UCCKPH   | // data captured on 1st clock edge, changed at following edge. Data sampled on rising edge.
                 UCSSEL__SMCLK; // enable clock

    UCA0BRW = 10; // clock speed set to 100kHz
    UCA0CTLW0 &= ~UCSWRST;   // begin SPI
}

void max_int_init() {
    P2DIR &= ~BIT1; // set P2.1 as interrupt input from MAX30002
    P2REN |= BIT1; // turn on internal resistor
    P2OUT |= BIT1; // enable pull-up

    P2IES |= BIT1; // detect interrupt on falling edge (1 to 0)
    P2IFG &= ~BIT1; // clear stale interrupt flag
    P2IE |= BIT1; // enable P2.1 interrupt

    if (!(P2IN & BIT1)) { // if P2.1 reads as 0, INTB is alr active, so set max_flag manually
            max_flag = 1;
        }

}

void fclk_init(void) { // helper function to set up ACLK between MCU and MAX30002
    CSCTL4 |= SELA__REFOCLK; // set ACLK source to REFO (~32 KHz)

    P2DIR |= BIT2; // 2.2 becomes output
    P2SEL0 &= ~BIT2; // setting P2SEL0.2 value to 0
    P2SEL1 |= BIT2; // P2SEL1.2 value set to 1. Both of these lines make (Sel1,Sel0) as (1,0) to select ACLK output
}

uint8_t spi_transfer(uint8_t data) { // helper function to transfer over SPI (both ways at same time)
    while (!(UCA0IFG & UCTXIFG)); // wait until TX buffer ready
    UCA0TXBUF = data; // put data into TX buffer
    while (!(UCA0IFG & UCRXIFG)); // while no RX interrupts
    return UCA0RXBUF; // get information coming into RX buffer
}

uint32_t max30002_read_reg(uint8_t reg) { // helper function to read data from a register from max30002
    uint32_t data = 0;
    MAX_CS_LOW(); // enable MAX30002
    spi_transfer(((reg & 0x7F) << 1) | 0x01); // Send command byte. Format is 7 bit address + R/W indicator
    data |= ((uint32_t)spi_transfer(0x00) << 16); // getting top data byte
    data |= ((uint32_t)spi_transfer(0x00) << 8); // getting middle data byte
    data |= ((uint32_t)spi_transfer(0x00)); // getting bottom data byte
    MAX_CS_HIGH(); // disable MAX30002

    return data; // what we read from register 'reg'
}

void max30002_write_reg(uint8_t reg, uint32_t data) { // Helper function to write to MAX30002 reg
    MAX_CS_LOW(); // enable MAX30002
    spi_transfer(((reg & 0x7F) << 1) | 0x00); // Send command byte. Same as before, but 0 LSB for write
    spi_transfer((data >> 16) & 0xFF); // top byte of data
    spi_transfer((data >> 8) & 0xFF); // middle byte of data
    spi_transfer((data) & 0xFF); // bottom byte of data
    MAX_CS_HIGH(); // disable MAX30002
}

void max30002_reset(void) { // resets max30002
    max30002_write_reg(MAX_REG_SW_RST, 0x000000);
    __delay_cycles(100000); // 0.1 s delay
}

void max30002_synch(void) { // Begins new BIOZ operations on clock edge. Clears FIFO memory
    max30002_write_reg(MAX_REG_SYNCH, 0x000000);
    __delay_cycles(10000); // 10 ms delay
}

void max30002_fifo_reset(void) { // Begins new BIOZ operations by resetting FIFO. Operations of BIOZ active circuitry not impacted. (No settling/transients)
    max30002_write_reg(MAX_REG_FIFO_RST, 0x000000);
    __delay_cycles(10000); // 10ms delay
}

uint32_t max30002_read_status(void) { // how to determine why MAX interrupted
    return max30002_read_reg(MAX_REG_STATUS);
}

uint32_t max30002_read_info(void) { // gives interface/part/revision information
    return max30002_read_reg(MAX_REG_INFO);
}

uint32_t max30002_read_fifo(void) { // reads BIOZ FIFO at register 0x23. Uses same 32-clock read sequence.
    return max30002_read_reg(MAX_REG_FIFO);
}

int32_t bioz_parse(uint32_t raw) { // helper function to parse bioZ data. Bits [2:0] are status bits and bits [23:4] are the data.
    int32_t data = (int32_t)(raw >> 4)  & 0xFFFFF; // extract 20-bit signed BioZ sample
    if (data & 0x80000) // if bit 19 is 1 (negative)
        data |= 0xFFF00000; // sign-extend 20-bit value to 32-bit signed int
    return (int32_t) data; // returning the parsed data bits
}

// LED STATUS INDICATORS
void led_blink_measuring (void) { // blinking LED = measurement
    LED_TOGGLE();
    __delay_cycles (200000); // 0.2 seconds at 1MHz
}
void led_pulse_transmission (void) { // short pulse = successful event
    LED_ON();
    __delay_cycles(300000); // 0.3 second pulse
    LED_OFF();
}
void led_idle(void) { // LED off = idle/sleeping
    LED_OFF();
}
void error_handler (void) { // ensures LED is solid during error
    LED_ON();

    while(1); // LED stays permanently on with error
}
